code/openfoam/tutorials/incompressibleFluid/drivaerFastback/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [turbulentViscosity];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    freestream
    {
        type            calculated;
        value           uniform 0;
    }

    wall
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }

    processor
    {
        type            processor;
        value           uniform 0;
    }
}

// ************************************************************************* //
